case/oilWaterParticlesInterFoam/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type fixedFluxPressure;
        value uniform 0;
    }

    frontAndBack
    {
        type empty;
    }
}
